package com.yangxu.security.pojo.vo.rest;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * /**
 * .::::.
 * .::::::::.
 * :::::::::::
 * ..:::::::::::'
 * '::::::::::::'
 * .::::::::::
 * '::::::::::::::..
 * ..::::::::::::.
 * ``::::::::::::::::
 * ::::``:::::::::'        .:::.
 * ::::'   ':::::'       .::::::::.
 * .::::'      ::::     .:::::::'::::.
 * .:::'       :::::  .:::::::::' ':::::.
 * .::'        :::::.:::::::::'      ':::::.
 * .::'         ::::::::::::::'         ``::::.
 * ...:::           ::::::::::::'              ``::.
 * ```` ':.          ':::::::::'                  ::::..
 * '.:::::'                    ':'````..
 *
 * @program: content-config
 * @description: ResultCodeEnum
 * @author: Mr.WYW
 * @create: 2019-03-05 15:
 */
@AllArgsConstructor
@Getter
public enum ResultCodeEnum {

    SUCCESS(0, "ok"),
    SYSTEM999(999, "功能开发中"),
    SYSTEM1000(1000, "系统异常"),
    SYSTEM1005(1005, "调用参数不符合规范"),
    SYSTEM1006(1006, "调用参数缺失"),
    SYSTEM1007(1007, "用户未注册"),
    SYSTEM1008(1008, "用户身份验证失败"),
    SYSTEM1009(1009, "员工身份验证失败"),
    SYSTEM1010(1010, "店铺管理员身份验证失败"),
    SYSTEM1011(1011, "品牌管理员身份验证失败"),
    SYSTEM1012(1012, "超级管理员身份验证失败"),
    SYSTEM1013(1013, "小程序code错误"),
    SYSTEM1014(1014, "平台管理员身份验证失败"),
    SYSTEM1045(1045, "token解析异常"),
    SYSTEM1051(1051, "权限不足"),
    SYSTEM1072(1072,"会员卡号重复"),
    SYSTEM1111(1111, "请勿重复提交"),
    SYSTEM1115(1115, "验证码发送失败"),
    SYSTEM1116(1116, "验证码错误"),
    SYSTEM1117(1117, "验证码过期"),
    SYSTEM1118(1118, "账号密码错误"),
    SYSTEM1119(1119, "手机号不存在"),
    SYSTEM1120(1120, "手机号已存在"),




    SYSTEM1200(1200,"文件类型错误"),

    SYSTEM1400(1400,"手机号获取验证码次数已达"),



    SYSTEM1500(1500, "版本校验异常"),
    SYSTEM1700(1700, "缓存读取失败"),
    SYSTEM1800(1800, "文件上传失败"),
    SYSTEM2000(2000, "二方接口调用异常"),
    SYSTEM3000(3000, "三方接口调用异常"),


    INFO4000(4000, "用户名、密码不能为空"),
    INFO4001(4001, "验证码发送失败"),
    INFO4002(4002, "该手机号没有注册"),
    INFO4003(4003, "该账号未启用"),
    INFO4004(4004, "该账号已删除"),
    INFO4005(4005, "身份验证失败，请重新登录"),
    INFO4006(4006, "参数缺失"),
    INFO4007(4007, "参数错误"),
    INFO4008(4008, "没有权限"),
    INFO4009(4009, "已存在"),
    INFO4010(4010, "该服务类目已下架"),
    INFO4011(4011, "没有该服务"),
    INFO4012(4012, "该服务有店铺在使用"),
    INFO4013(4013, "该服务类目有店铺在使用"),
    INFO4014(4014, "该服务类目下有服务在使用"),
    INFO4015(4015, "该职位已存在"),
    INFO4016(4016, "该职员已存在"),
    INFO4017(4017, "该服务已在卡中引用"),
    INFO4018(4018, "该服务已在红包中引用"),
    INFO4019(4019, "该红包已在别处引用"),


    INFO4023(4023, "证件号已存在"),
    INFO4024(4024, "请完善基本信息"),
    INFO4025(4025, "手机号格式不正确"),
    INFO4026(4026, "证件号格式不正确"),
    INFO4027(4027, "获取openid"),


    INFO4030(4030, "店铺数量已达上限"),
    INFO4031(4031, "店铺编号已存在"),
    INFO4032(4032, "分配数量不能为零"),
    INFO4033(4033, "数量超过限额"),
    INFO4034(4034, "会员卡折扣不能重复"),
    INFO4035(4035, "会员卡金额不唯一的会员卡不能支持补差价"),
    INFO4036(4036, "密码错误"),
    INFO4037(4037, "至少启用一个发型师"),
    INFO4038(4038, "请完善小程序配置信息"),
    INFO4039(4039, "请完善支付配置信息"),
    INFO4040(4040, "请完善服务信息"),
    INFO4041(4041, "已存在"),
    INFO4042(4042, "服务未完成"),
    INFO4043(4043, "不能操作"),
    INFO4044(4044, "不存在"),
    INFO4045(4045, "卡包子卡数量至少为2"),

    INFO6010(6010, "品牌或店铺不存在"),

    INFO6020(6020, "负责人编号为空"),

    /**
     * 系统开关模块8000-10000
     */
    INFO8010(8010, "请先开启纸质流水单"),
    INFO8015(8015, "请先开启打印小票"),
    INFO8020(8020, "扫码盒子相关配置信息不完善"),





    /**
     * 店铺基础信息模块10000-12000
     */
    INFO10010(10010, "时间转换失败"),
    INFO10015(10015, "初始化职位失败"),
    INFO10020(10020, "初始化品牌配置失败"),
    INFO10100(10100, "没有找到该品牌"),
    INFO10106(10106, "手机号相同"),
    INFO10115(10115, "品牌数据异常"),
    INFO10120(10120, "更新品牌信息失败"),
    INFO10150(10150, "品牌信息里负责人编号是空的"),
    INFO10200(10200, "没有找到该店铺"),
    INFO10215(10215, "店铺数据异常"),
    INFO10220(10220, "更新店铺信息失败"),
    INFO10250(10250, "店铺信息里负责人编号是空的"),

    INFO11505(10505, "功能类别已存在"),
    INFO11506(10506, "功能类别不存在"),

    INFO10401(10401, "店铺邮箱格式不正确"),


    INFO11500(11500, "服务类型只能加，不能减"),






    INFO12000(12000, "版本不存在"),



    /**
     * 店铺员工模块20000-22000
     */
    INFO20000(20000, "职位已存在"),
    INFO20001(20001, "不存在该职位"),
    INFO20002(20002, "职位已有员工"),
    INFO20003(20003, "不存在该职员"),
    INFO20005(20005, "职员编号不可用"),
    INFO20006(20006, "不能删除，至少拥有一位启用的职员"),
    INFO20010(20010, "职位下曾有服务，不能删除"),
    INFO20012(20012, "删除实际劳动业绩提成失败"),
    INFO20014(20014, "删除虚拟劳动业绩提成失败"),

    INFO20050(20050, "该手机号的账号品牌或店铺已删除"),
    INFO20200(20200, "店铺已存在"),
    INFO20205(20205, "品牌管理员不存在"),




    /**
     * 店铺管理员模块22000-24000
     */
    INFO22020(22020, "该手机号已存在"),
    INFO22029(22029, "管理员数量已达上限"),
    INFO22100(22100, "不存在该管理员"),
    INFO22101(22101, "未启用该管理员"),
    INFO22150(22150, "不存在该负责人"),
    INFO22151(22151, "未启用该负责人"),
    INFO22175(22175, "平台管理员已存在"),
    INFO22176(22176, "平台管理员不存在"),
    INFO22177(22177, "平台管理员未启用"),

    INFO22760(22760, "新增超级管理员失败"),
    INFO22762(22762, "修改超级管理员失败"),
    INFO22764(22764, "删除超级管理员失败"),
    INFO22766(22766, "查询超级管理员失败"),


    /**
     * 项目商品模块24000-26000
     */
    INFO24010(24010, "该卡曾有服务，不能删除"),
    INFO24020(24020, "存在卡引用该服务"),
    INFO24100(24100, "类目库中不存在该类目"),
    INFO24105(24105, "该类目已存在"),
    INFO24106(24106, "该类目名称已存在"),
    INFO24107(24107, "该类目不存在"),
    INFO24110(24110, "类目下存在使用中的服务"),
    INFO24115(24115, "类目下存在区分长短发的服务，修改失败"),
    INFO24116(24116,"洗剪吹不能操作"),
    INFO24117(24117,"服务信息不完善"),





    /**
     * 库存模块26000-28000
     */
    INFO26095(26095, "库存服务批量配置，未检测到服务信息"),
    INFO26097(26097, "商品库存未初始化"),
    INFO26098(26098, "出库库存不足"),


    /**
     * 积分模块30000-32000
     */
    INFO30005(30005, "积分账户不足"),
    INFO30010(30010, "无品牌积分配置"),
    INFO30050(30050,"赠送积分超过可配置最大值"),
    /**
     * 消息模块34000-36000
     */
    INFO34001(34001,"店铺短信余额不足"),
    INFO34002(34002,"用戶不需要短信"),
    INFO34003(34003,"短信扣费方式为空"),
    INFO34004(34004,"短信候补发送"),
    INFO34005(34005,"包月费扣除失败，不发送"),
    INFO34006(34006,"用户余额不足"),
    INFO34091(34091, "不能包含表情符号"),
    INFO34078(34078, "短信长度不能超过122字"),
    INFO34300(34300, "签名长度不能超过8个字符"),
    INFO34500(34500, "调用微信支付下单接口异常"),
    INFO34444(34444,"第三方发送失败"),
    INFO34505(34505, "调用微信支付下单接口失败"),

    INFO34601(34601,"目标发送列表为空"),
    INFO34602(34602,"群发列表缓存获取失败"),
    INFO34603(34603,"群发单操作失败失败"),

    INFO34800(34800,"验证码存入缓存失败"),
    INFO34801(34801,"目标发送用户无效"),
    INFO34802(34802,"品牌未找到"),
    INFO34803(34803,"店铺未找到"),

    INFO35001(35001,"店铺群发设置已存在"),


    /**
     * 登录模块44000 - 46000
     */
    INFO44000(44000, "该系统中不存在该openid的账号"),
    INFO44001(44001, "openId解析结果为空"),
    INFO44005(44005, "手机号不存在"),
    INFO44010(44010, "品牌或店铺未启用"),
    INFO44020(44020, "员工不存在"),
    INFO44021(44021, "员工编号不存在"),
    INFO44028(44028, "请求头CT不能为空"),

    INFO44050(44050, "管理员没有可管理的店铺"),

    INFO44100(44100, "二维码已过期"),
    INFO44101(44101, "二维码未与用户绑定信息"),


    INFO80000(80000, "end");
    /**
     * 成员变量
     */
    private int code;
    private String msg;

    /**
     * 自定义业务方法
     */
    public static ResultCodeEnum getEnumById(int code) {
        for (ResultCodeEnum resultCodeEnum : ResultCodeEnum.values()) {
            if (resultCodeEnum.code == code) {
                return resultCodeEnum;
                /**返回ENUM对象用户统一返回封装类*/
            }
        }
        return null;
    }

}
